app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."publish" = ?  [["publish", "t"]]
---
	def index
    @blogs = Blog.where(publish: true)