app/controllers/grapes_controller.rb

SELECT "grapes".* FROM "grapes" WHERE "grapes"."publish" = ?  [["publish", "t"]]
---
  def index
    @about_detail = Detail.find_by(detail_type: "About")
    @blog_detail = Blog.order_by_desc.take
    @region_detail = Detail.find_by(detail_type: "Region")

    @grapes = Grape.where(publish: true)