app/controllers/index_controller.rb

	def search
		if params[:search_select] == 'Wine'

			@wines = Wine.where("name LIKE ?", "%#{params[:search]}%")
			@wines = Wine.where(publish: 't')
			@grapes = nil
		end
		if params[:search_select] == 'Grape'

			@grapes = Grape.where("name LIKE ?", "%#{params[:search]}%")
			@grapes = Grape.where(publish: 't')
---
SELECT "wines".* FROM "wines" WHERE "wines"."publish" = ?  [["publish", "t"]]
SELECT "grapes".* FROM "grapes" WHERE "grapes"."publish" = ?  [["publish", "t"]]