app/controllers/wines_controller.rb

	def index
    @about_detail = Detail.find_by(detail_type: "About")
    @blog_detail = Blog.order_by_desc.take
    @grape_detail = Grape.order_by_desc.take

    @wines = Wine.where(publish: true)
---
SELECT "wines".* FROM "wines" WHERE "wines"."publish" = ?  [["publish", "t"]]